export const faqs = [
  {
    question: "ما هو موقع التعليم الإلكتروني؟",
    answer:
      "موقع التعليم الإلكتروني هو منصة تعليمية تهدف إلى توفير مساحة للطلاب في جميع المراحل الدراسية لرفع ومشاركة الملفات الخاصة بهم. يمكن للطلاب تحميل الملفات التعليمية والواجبات والاختبارات والموارد الأخرى التي تساعدهم في مساراتهم التعليمية.",
  },
  {
    question: "ما هي فوائد استخدام موقع التعليم الإلكتروني؟",
    answer:
      "يوفر موقع التعليم الإلكتروني فرصة للطلاب للوصول إلى الموارد التعليمية بسهولة ويسر. يمكنهم تحميل الملفات والوثائق التعليمية من أي مكان وفي أي وقت. يساعد الموقع الطلاب على مشاركة الموارد مع زملائهم والتعاون في العمل الجماعي. كما يوفر الموقع أيضًا واجهة بسيطة وسهلة الاستخدام لتحسين تجربة المستخدم.",
  },
  {
    question: "ما هي المراحل التعليمية المدعومة في موقع التعليم الإلكتروني؟",
    answer:
      "يدعم موقع التعليم الإلكتروني طلاب جميع المراحل التعليمية بدءًا من التعليم الابتدائي وحتى التعليم الثانوي والتعليم الجامعي. يوفر الموقع مساحة للملفات والموارد المناسبة لكل مرحلة تعليمية، مما يساعد الطلاب في الوصول إلى المحتوى الذي يلبي احتياجاتهم التعليمية.",
  },
  {
    question: "كيف يمكن للطلاب الاستفادة من موقع التعليم الإلكتروني؟",
    answer:
      "يمكن للطلاب الاستفادة من موقع التعليم الإلكتروني عن طريق التسجيل في الموقع وإنشاء حساب شخصي. بعد ذلك، يمكنهم تسجيل الدخول وتصفح الملفات وتحميلها ومشاركتها مع زملائهم. يمكنهم أيضًا الاطلاع على الموارد التعليمية الأخرى المتاحة على الموقع والاستفادة منها في دراستهم.",
  },
  {
    question: "ما هو موقع التعليم الإلكتروني؟",
    answer:
      "موقع التعليم الإلكتروني هو منصة تعليمية تهدف إلى توفير مساحة للطلاب في جميع المراحل الدراسية لرفع ومشاركة الملفات الخاصة بهم. يمكن للطلاب تحميل الملفات التعليمية والواجبات والاختبارات والموارد الأخرى التي تساعدهم في مساراتهم التعليمية.",
  },
  {
    question: "ما هي فوائد استخدام موقع التعليم الإلكتروني؟",
    answer:
      "يوفر موقع التعليم الإلكتروني فرصة للطلاب للوصول إلى الموارد التعليمية بسهولة ويسر. يمكنهم تحميل الملفات والوثائق التعليمية من أي مكان وفي أي وقت. يساعد الموقع الطلاب على مشاركة الموارد مع زملائهم والتعاون في العمل الجماعي. كما يوفر الموقع أيضًا واجهة بسيطة وسهلة الاستخدام لتحسين تجربة المستخدم.",
  },
  {
    question: "ما هي المراحل التعليمية المدعومة في موقع التعليم الإلكتروني؟",
    answer:
      "يدعم موقع التعليم الإلكتروني طلاب جميع المراحل التعليمية بدءًا من التعليم الابتدائي وحتى التعليم الثانوي والتعليم الجامعي. يوفر الموقع مساحة للملفات والموارد المناسبة لكل مرحلة تعليمية، مما يساعد الطلاب في الوصول إلى المحتوى الذي يلبي احتياجاتهم التعليمية.",
  },
  {
    question: "كيف يمكن للطلاب الاستفادة من موقع التعليم الإلكتروني؟",
    answer:
      "يمكن للطلاب الاستفادة من موقع التعليم الإلكتروني عن طريق التسجيل في الموقع وإنشاء حساب شخصي. بعد ذلك، يمكنهم تسجيل الدخول وتصفح الملفات وتحميلها ومشاركتها مع زملائهم. يمكنهم أيضًا الاطلاع على الموارد التعليمية الأخرى المتاحة على الموقع والاستفادة منها في دراستهم.",
  },
];
// export const classes=[
//   {
//     id:1,
//     nameLevel:"المرحلة الابتدائية",
//     nameClass:"الصف الأول الابتدائي",

//   },
//   {
//     id:2,
//     nameLevel:"المرحلة الابتدائية",
//     nameClass:"الصف الثاني الابتدائي"
//   },
//   {
//     id:3,
//     nameLevel:"المرحلة الابتدائية",
//     nameClass:"الصف الثالث الابتدائي"
//   },
//   {
//     id:4,
//     nameLevel:"المرحلة الابتدائية",
//     nameClass:"الصف الرابع الابتدائي"
//   },

//   {
//     id:5,
//     nameLevel:"المرحلة الاعدادية",
//     nameClass:"الصف الخامس الاعدادي",

//   },
//   {
//     id:6,
//     nameLevel:"المرحلة الاعدادية",
//     nameClass:"الصف السادس الاعدادي"
//   },
//   {
//     id:7,
//     nameLevel:"المرحلة الاعدادية",
//     nameClass:"الصف السابع الاعدادي"
//   },
//   {
//     id:8,
//     nameLevel:"المرحلة الاعدادية",
//     nameClass:"الصف الثامن الاعدادي"
//   },
//   {
//     id:9,
//     nameLevel:"المرحلة الاعدادية",
//     nameClass:"الصف التاسع الاعدادي"
//   },
//   {
//     id:10,
//     nameLevel:"المرحلة الثانوية",
//     nameClass:"الصف العاشر",
//   },
//   {
//     id:11,
//     nameLevel:"المرحلة الثانوية",
//     nameClass:"الصف الحادي عشر",
//   },
//   {
//     id:12,
//     nameLevel:"المرحلة الثانوية",
//     nameClass:"الصف الثاني عشر"
//   }
// ],

export const Classes = [
  {
    nameLevel: "المرحلة الابتدائية",
    AcademicStage: "Primary",
    classes: [
      {
        id: 0,
        nameClass: "الصف الأول",
        link: "1",
        semesters: [
          {
            id: 1,
            nameSemester: "الفصل الدراسي الأول",
            subjects: [
              {
                id: 1,
                nameSubject: "الرياضيات",
                topics: [
                  {
                    id: 1,
                    nameTopic: "الجمع",
                    file: "link_to_file",
                  },
                ],
              },
              {
                id: 2,
                nameSubject: "اللغة العربية",
              },
            ],
          },
          {
            id: 2,
            nameSemester: "الفصل الدراسي الثاني",
            subjects: [
              {
                id: 1,
                nameSubject: "الرياضيات",
                topics: [
                  {
                    id: 1,
                    nameTopic: "الجمع",
                    file: "link_to_file",
                  },
                ],
              },
              {
                id: 2,
                nameSubject: "اللغة العربية",
              },
            ],
          },
          {
            id: 3,
            nameSemester: "الفصل الدراسي الثالث",
            subjects: [
              {
                id: 1,
                nameSubject: "الرياضيات",
                topics: [
                  {
                    id: 1,
                    nameTopic: "الجمع",
                    file: "link_to_file",
                  },
                ],
              },
              {
                id: 2,
                nameSubject: "اللغة العربية",
              },
            ],
          },
        ],
      },
      { id: 1, nameClass: "الصف الثاني", link: "2" },
      { id: 2, nameClass: "الصف الثالث", link: "3" },
      { id: 3, nameClass: "الصف الرابع", link: "4" },
    ],
  },
  {
    nameLevel: "المرحلة الاعدادية",
    AcademicStage: "Preparatory",
    classes: [
      { id: 4, nameClass: "الصف الخامس", link: "5" },
      { id: 5, nameClass: "الصف السادس", link: "6" },
      { id: 6, nameClass: "الصف السابع", link: "7" },
      { id: 7, nameClass: "الصف الثامن", link: "8" },
    ],
  },
  {
    nameLevel: "المرحلة الثانوية",
    AcademicStage: "Secondary",
    classes: [
      { id: 8, nameClass: "الصف التاسع", link: "9" },
      { id: 9, nameClass: "الصف العاشر", link: "10" },
      { id: 10, nameClass: "الصف الحادي عشر", link: "11" },
      { id: 11, nameClass: "الصف الثاني عشر", link: "12" },
    ],
  },
];
