import React from 'react'
import { AiOutlineArrowLeftMini } from "../lib/@react-icons";
import Button from '../Components/Button';

const page = () => {
  return (
    <div className='my-40 md:mx-24'>
      <div>
        <div className='flex justify-between items-center'>
          <h3 className='text-[#00052E] text-xl font-medium'>
            الصف الثالث الإعدادي - الفصل الدراسي الأول
          </h3>
          <div className="flex justify-center items-center gap-2 cursor-pointer ">
            <h3 className='text-[#00052E] text-xl font-semibold underline'>العودة لصفحة المنهج</h3>
            <AiOutlineArrowLeftMini />
          </div>
        </div>
      </div>
      <div className='bg-[--seconderay] w-full h-[250px] my-12 text-white flex justify-center items-center rounded-xl'>
        <h1 className='text-4xl'>
          الملف الثاني : اختبار اللغة العربية
        </h1>
      </div>
      <div className='text-black'>
        <p>
          الذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم طلابنا وطالباتنا المتميزين موضوع جديد عن مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول على موقع دروسنا اتحميل مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول يمكنكم أيضًا متابعة كل ما ننشره في جميع المواد عن الطريق القسم الخاص بهذا الصف. لاماراتية المتخصص في مناهج التعليم الاماراتي.
          الذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم طلابنا وطالباتنا المتميزين موضوع جديد عن مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول على موقع دروسنا اتحميل مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول يمكنكم أيضًا متابعة كل ما ننشره في جميع المواد عن الطريق القسم الخاص بهذا الصف. لاماراتية المتخصص في مناهج التعليم الاماراتي.

          <br />
          <br />
          الذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم طلابنا وطالباتنا المتميزين موضوع جديد عن مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول على موقع دروسنا اتحميل مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول يمكنكم أيضًا متابعة كل ما ننشره في جميع المواد عن الطريق القسم الخاص بهذا الصف. لاماراتية المتخصص في مناهج التعليم الاماراتي.
          الذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم طلابنا وطالباتنا المتميزين موضوع جديد عن مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول على موقع دروسنا اتحميل مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول يمكنكم أيضًا متابعة كل ما ننشره في جميع المواد عن الطريق القسم الخاص بهذا الصف. لاماراتية المتخصص في مناهج التعليم الاماراتي.
        </p>
        <br />
        <p>
          الذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم طلابنا وطالباتنا المتميزين موضوع جديد عن مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول على موقع دروسنا اتحميل مذكرة علوم الكمبيوتر للصف العاشر الفصل الأول يمكنكم أيضًا متابعة كل ما ننشره في جميع المواد عن الطريق القسم الخاص بهذا الصف. لاماراتية المتخصص في مناهج التعليم الاماراتي.
        </p>
        لذي يقدم كل جديد من كتب ومذكرات وحل الدروس أول بأول، فتابعونا يوميًا حتى تحققوا أفضل استفادة ممكنة. قدم لكم

        <div className='flex justify-center items-center flex-col'>
          <Button textinner="قم بتحميل الملف الأن" ClassNameAdd='bg-[--seconderay]  px-8 py-2 mt-8' />
        </div>
      </div>
    </div>
  )
}

export default page